<!-- dflook/terraform-github-actions {"workspace":"unlock-state-2","backend_type":"remote","backend":"6afa57d25ba234d730570b92997b65c888ca345e58fb92c63134599befa106f4","plan_job_ref":"Job Test Terraform cloud #125 at https://github.com/dflook/terraform-github-actions/actions/runs/4028991199","plan_hash":"d6adbcb6c3fdeec220536ea7c7410a05c06927fcaddeb14853d631a1ba5a28f6","plan_text_format":"text","version":"1.31.1"} -->
Terraform plan in __tests/workflows/test-cloud/1.0__ in the __unlock-state-2__ workspace
With var files: `tests/workflows/test-cloud/1.0/my_variable.tfvars
`
With variables: `from_variables = "from_variables"`
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # random_id.the_id will be created
  + resource "random_id" "the_id" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 5
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + default        = "default"
  + from_tfvars    = "from_tfvars"
  + from_variables = "from_variables"
```
</details>

:memo: Plan generated in [Test Terraform cloud #125](https://github.com/dflook/terraform-github-actions/actions/runs/4028991199)